{
  "kong-ee": [
    {
      "message": "**Request Transformer Advanced**: Values stored in `key:value` pairs in this plugin’s configuration are now referenceable, which means they can be stored as [secrets](https://docs.konghq.com/gateway/latest/kong-enterprise/secrets-management/) in a vault.",
      "type": "feature",
      "scope": "Plugin"
    },
    {
      "message": "Unpinned the version of `alpine` used in the `kong/kong-gateway` Docker image. Previously, the version was pinned to 3.10, which was creating outdated `alpine` builds.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue with how Kong initializes `resty.events`. The code was previously using `ngx.config.prefix()` to determine the listening socket path to provide to the resty.events module. This caused breakage when Nginx was started with a relative path prefix. This meant that you couldn’t start 3.0.x with the same default configuration as 2.8.x.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue with secret management references for HashiCorp Vault. By default, Kong passes secrets to the Nginx using environment variables when using `kong start`. Nginx was being started directly without calling `kong start`, so the secrets were not available at initialization. [#9478](https://github.com/Kong/kong/pull/9478): ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed the Amazon Linux RPM installation instructions.: ",
      "type": "bugfix",
      "scope": "Core"
    }
  ],
  "kong-manager-ee": [
    {
      "message": "Removed the endpoint `all_routes` from configurable RBAC endpoint permissions. This endpoint was erroneously appearing in the endpoints list, and didn’t configure anything.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue that allowed unauthorized IDP users to log in to Kong Manager. These users had no access to any resources in Kong Manager, but were able to go beyond the login screen.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where, in an environment with a valid Enterprise license, admins with no access to the `default` workspace would see a message prompting them to upgrade to Kong Enterprise.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed pagination issues with Kong Manager tables.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed broken `Learn more` links.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue with group to role mapping, where it didn’t support group names with spaces.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed the Cross Site Scripting (XSS) security vulnerability in the Kong Manager UI.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an RBAC issue where permissions applied to specific endpoints (for example, an individual service or route) were not reflected in the Kong Manager UI.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Removed New Relic from Kong Manager. Previously, `VUE_APP_NEW_RELIC_LICENSE_KEY` and`VUE_APP_SEGMENT_WRITE_KEY` were being exposed in Kong Manager with invalid values.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Removed the action dropdown menu on service and route pages for read-only users.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed the **Edit Configuration** button for Dev Portal applications.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an RBAC issue where the roles page listed deleted roles.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where the orphaned roles would remain after deleting a workspace and cause the **Teams** \\> **Admins** page to break.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Added the missing **Copy JSON** button for plugin configuration.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where the **New Workspace** button on the global workspace dashboard wasn’t clickable on the first page load.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Removed the ability to add multiple documents per service from the UI. Each service only supports one document, so the UI now reflects that.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "The Upstream Timeout plugin now has an icon and is part of the Traffic Control category.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an error that would occur when attempting to delete ACL credentials from the consumer credentials list. This happened because the name of the plugin, `acl`, and its endpoint, `/acls`, don’t match.: ",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed a caching issue with Dev Portal, where enabling or disabling the Dev Portal for a workspace wouldn’t change the Kong Manager menu.: ",
      "type": "bugfix",
      "scope": "Core"
    }
  ]
}