{
  "kong-ee": [
    {
      "message": "Added an optional configuration parameter, `admin_gui_hide_konnect_cta`, which controls the visibility of the Konnect call-to-action in Kong Manager.",
      "type": "feature",
      "scope": "Configuration"
    },
    {
      "message": "Schema map values can now assume null values. This fixes an issue where values in custom schemas wouldn’t accept explicit null values for the removal of fields.",
      "type": "feature",
      "scope": "Core"
    },
    {
      "message": "Added a new `kong.request.get_raw_forwarded_path()` function for returning the non-normalized `forwarded_path`. This fixes an issue with the OpenID Connect plugin, which was normalizing the path when it shouldn’t.",
      "type": "feature",
      "scope": "PDK"
    },
    {
      "message": "Applied a patch from upstream OpenResty to fix an issue where upstream connection pooling failed when pool names exceeded 32 characters.",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where the rate limiting library could become deadlocked with Postgres.",
      "type": "bugfix",
      "scope": "Performance"
    },
    {
      "message": "Optimized the querying of the default workspace by directly accessing LMDB, improving performance.",
      "type": "bugfix",
      "scope": "Performance"
    },
    {
      "message": "Fixed an issue where the delta type was not being validated during incremental sync.",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where the error logs generated during router rebuilds could be excessively noisy.",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where log lines could be incorrectly logged.",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "Fixed an issue where a full configuration sync caused the data plane to stop proxying when incremental config sync was enabled.",
      "type": "bugfix",
      "scope": "Core"
    },
    {
      "message": "**Request Callout**: The plugin now logs the request URL, response code, and request latency (in milliseconds).",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where a callout response wasn’t available to response `by_lua` code.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where caching options modified via `by_lua` would apply to all subsequent callouts.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where callouts with the same name would be accepted.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Query parameters specified via `callout.request.query` now correctly replace those in the callout URL.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where values in `custom` wouldn’t accept explicit null values for removal of fields.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where callout and upstream request body customizations weren’t performed when an empty request body was provided. Now, an empty JSON body is used and `Content-Type: application/json` is added to the request.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Request Callout**: Fixed an issue where the Request Callout plugin failed with a timeout when `callouts.request.body.custom` was null and `callouts.request.headers.forward` was set to `true`.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**OpenID Connect**: Fixed an issue which caused an IdP to report invalid `redirect_uri` errors when `config.redirect_uri` was not configured and the URI path contained spaces.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "**Session**: Fixed an issue where boolean configuration fields `hash_subject` (default `false`) and `store_metadata` (default `false`) stored the session’s metadata in the database. This also resolves an issue with Dev Portal, where adding these fields to `portal_session_conf` wasn’t working as expected.",
      "type": "bugfix",
      "scope": "Plugin"
    },
    {
      "message": "Fixed an issue where the data plane (DP) could report a healthy status before it was actually ready to accept traffic.",
      "type": "bugfix",
      "scope": "Admin API"
    },
    {
      "message": "Fixed an issue where debug level logs for incremental sync were insufficient, making debugging more difficult.",
      "type": "bugfix",
      "scope": "Clustering"
    },
    {
      "message": "Fixed an issue where some logs were missing when incremental sync was enabled on the data plane side.",
      "type": "bugfix",
      "scope": "Clustering"
    },
    {
      "message": "Fixed an issue where the data plane could repeatedly trigger a full sync when incremental sync was enabled.",
      "type": "bugfix",
      "scope": "Clustering"
    }
  ],
  "kong-manager-ee": []
}